# CallToolByIndex

## Description
Similar to CallTool. Takes the internal ID of a tool (Script Appendix)

```pascal
FUNCTION CallToolByIndex(toolIndex : INTEGER): BOOLEAN;
```

```python
def vs.CallToolByIndex(toolIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|toolIndex|INTEGER|   |

## Examples
#### VectorScript ####
```pascal
Message( CallToolByIndex( -221 ) ) { activate locus tool, returns true if successful }
```
#### Python ####
```python
vs.Message( vs.CallToolByIndex( -221 ) ) # activate locus tool, returns true if successful
```

```pascal
resultOK := CallToolByIndex(1);
```
```python
import vs

# Similar to CallTool.
toolIndex = 1

ok = vs.CallToolByIndex(toolIndex)
if ok:
    vs.Message('CallToolByIndex succeeded')
else:
    vs.Message('CallToolByIndex failed')
```

## See Also
VS Functions:
* CallTool
* CallToolByName

## Version
Availability: from Vectorworks 2014

## Category
* Utility